testing/stochastic_latency_load_test.yml
config:
  phases:
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 9
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 10
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 26
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 25
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 0
    duration: 60
    name: Stochastic  UnLoad
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 26
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 25
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 25
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 10
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 10
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 10
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 0
    duration: 60
    name: Stochastic  UnLoad
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 8
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 0
    duration: 60
    name: Stochastic  UnLoad
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 9
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 10
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 25
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 9
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 18
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 23
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 11
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 13
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 9
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 24
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 10
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 14
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 12
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 21
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 20
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 19
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 17
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 16
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 15
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 22
    duration: 1
    name: Stochastic latency Load Phase
  - arrivalRate: 0
    duration: 60
    name: Stochastic  UnLoad
  target: https://order-juank1400-dev.apps.rm3.7wse.p1.openshiftapps.com
  variables:
    category:
    - apl
    - rht
    - ibm
    - aws
scenarios:
- flow:
  - post:
      headers:
        Content-Type: application/json
      json:
        asset: '{{category}}'
        id: '{{ $randomNumber(1350000001, 100000000) }}'
        quantity: '{{$randomNumber(3,14)}}'
        type: buy
      url: /orders